docs/benchmark/results-wrk2-c1000/raw/nginx-R100000-r2.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.927ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.105ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.150ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.915ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.07ms    1.32ms  18.90ms   80.38%
    Req/Sec    26.40k     4.45k   41.00k    71.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.85ms
 75.000%    2.60ms
 90.000%    3.47ms
 99.000%    6.83ms
 99.900%   13.39ms
 99.990%   17.15ms
 99.999%   18.85ms
100.000%   18.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.057     0.000000            1         1.00
       0.798     0.100000        37571         1.11
       1.116     0.200000        75100         1.25
       1.360     0.300000       112570         1.43
       1.598     0.400000       150119         1.67
       1.848     0.500000       187554         2.00
       1.981     0.550000       206325         2.22
       2.119     0.600000       225188         2.50
       2.261     0.650000       243781         2.86
       2.419     0.700000       262560         3.33
       2.599     0.750000       281256         4.00
       2.703     0.775000       290626         4.44
       2.817     0.800000       300081         5.00
       2.945     0.825000       309379         5.71
       3.093     0.850000       318844         6.67
       3.267     0.875000       328224         8.00
       3.363     0.887500       332900         8.89
       3.471     0.900000       337558        10.00
       3.591     0.912500       342254        11.43
       3.729     0.925000       346897        13.33
       3.901     0.937500       351609        16.00
       4.001     0.943750       353956        17.78
       4.119     0.950000       356318        20.00
       4.263     0.956250       358652        22.86
       4.443     0.962500       360970        26.67
       4.691     0.968750       363290        32.00
       4.843     0.971875       364489        35.56
       5.003     0.975000       365640        40.00
       5.179     0.978125       366814        45.71
       5.431     0.981250       367969        53.33
       5.883     0.984375       369142        64.00
       6.175     0.985938       369727        71.11
       6.391     0.987500       370313        80.00
       6.647     0.989062       370902        91.43
       6.975     0.990625       371488       106.67
       7.399     0.992188       372072       128.00
       7.731     0.992969       372364       142.22
       8.171     0.993750       372656       160.00
       8.631     0.994531       372947       182.86
       9.151     0.995313       373240       213.33
       9.727     0.996094       373534       256.00
      10.031     0.996484       373681       284.44
      10.463     0.996875       373830       320.00
      10.943     0.997266       373972       365.71
      11.367     0.997656       374119       426.67
      11.911     0.998047       374266       512.00
      12.239     0.998242       374339       568.89
      12.591     0.998437       374413       640.00
      12.855     0.998633       374485       731.43
      13.087     0.998828       374558       853.33
      13.463     0.999023       374631      1024.00
      13.647     0.999121       374668      1137.78
      13.911     0.999219       374706      1280.00
      14.175     0.999316       374741      1462.86
      14.519     0.999414       374778      1706.67
      14.807     0.999512       374814      2048.00
      15.055     0.999561       374833      2275.56
      15.199     0.999609       374852      2560.00
      15.319     0.999658       374870      2925.71
      15.463     0.999707       374888      3413.33
      15.583     0.999756       374906      4096.00
      15.663     0.999780       374916      4551.11
      15.807     0.999805       374924      5120.00
      15.943     0.999829       374933      5851.43
      16.375     0.999854       374944      6826.67
      16.479     0.999878       374953      8192.00
      16.847     0.999890       374957      9102.22
      17.199     0.999902       374962     10240.00
      17.215     0.999915       374965     11702.86
      17.407     0.999927       374970     13653.33
      17.647     0.999939       374975     16384.00
      17.743     0.999945       374977     18204.44
      17.887     0.999951       374979     20480.00
      17.935     0.999957       374981     23405.71
      18.047     0.999963       374984     27306.67
      18.079     0.999969       374987     32768.00
      18.079     0.999973       374987     36408.89
      18.159     0.999976       374988     40960.00
      18.175     0.999979       374989     46811.43
      18.239     0.999982       374991     54613.33
      18.447     0.999985       374992     65536.00
      18.447     0.999986       374992     72817.78
      18.847     0.999988       374993     81920.00
      18.847     0.999989       374993     93622.86
      18.879     0.999991       374994    109226.67
      18.895     0.999992       374995    131072.00
      18.895     0.999993       374995    145635.56
      18.895     0.999994       374995    163840.00
      18.895     0.999995       374995    187245.71
      18.911     0.999995       374997    218453.33
      18.911     1.000000       374997          inf
#[Mean    =        2.073, StdDeviation   =        1.325]
#[Max     =       18.896, Total count    =       374997]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1427971 requests in 15.00s, 0.89GB read
Requests/sec:  95185.60
Transfer/sec:     60.55MB