docs/benchmark/results-wrk2-c1000/raw/nginx-R100000-r3.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 2.415ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.394ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.409ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.431ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.47ms    1.66ms  20.21ms   80.07%
    Req/Sec    26.37k     4.93k   48.00k    68.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.20ms
 75.000%    3.12ms
 90.000%    4.15ms
 99.000%    9.08ms
 99.900%   16.26ms
 99.990%   18.67ms
 99.999%   19.84ms
100.000%   20.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.052     0.000000            1         1.00
       0.813     0.100000        37561         1.11
       1.286     0.200000        75014         1.25
       1.600     0.300000       112594         1.43
       1.897     0.400000       150072         1.67
       2.201     0.500000       187577         2.00
       2.357     0.550000       206388         2.22
       2.523     0.600000       225059         2.50
       2.705     0.650000       243959         2.86
       2.901     0.700000       262691         3.33
       3.119     0.750000       281388         4.00
       3.241     0.775000       290806         4.44
       3.371     0.800000       300123         5.00
       3.519     0.825000       309466         5.71
       3.687     0.850000       318825         6.67
       3.889     0.875000       328183         8.00
       4.011     0.887500       332928         8.89
       4.147     0.900000       337626        10.00
       4.303     0.912500       342330        11.43
       4.475     0.925000       346937        13.33
       4.707     0.937500       351644        16.00
       4.859     0.943750       354002        17.78
       5.031     0.950000       356381        20.00
       5.203     0.956250       358694        22.86
       5.407     0.962500       361010        26.67
       5.751     0.968750       363363        32.00
       6.027     0.971875       364518        35.56
       6.299     0.975000       365704        40.00
       6.571     0.978125       366863        45.71
       6.911     0.981250       368042        53.33
       7.351     0.984375       369209        64.00
       7.659     0.985938       369792        71.11
       8.099     0.987500       370382        80.00
       8.663     0.989062       370966        91.43
       9.335     0.990625       371553       106.67
       9.879     0.992188       372135       128.00
      10.223     0.992969       372429       142.22
      10.751     0.993750       372723       160.00
      11.287     0.994531       373015       182.86
      11.839     0.995313       373306       213.33
      12.431     0.996094       373601       256.00
      12.759     0.996484       373748       284.44
      13.047     0.996875       373894       320.00
      13.391     0.997266       374040       365.71
      13.743     0.997656       374186       426.67
      14.247     0.998047       374332       512.00
      14.647     0.998242       374405       568.89
      14.919     0.998437       374478       640.00
      15.343     0.998633       374553       731.43
      15.823     0.998828       374625       853.33
      16.287     0.999023       374700      1024.00
      16.415     0.999121       374738      1137.78
      16.543     0.999219       374774      1280.00
      16.863     0.999316       374811      1462.86
      17.231     0.999414       374845      1706.67
      17.503     0.999512       374881      2048.00
      17.631     0.999561       374900      2275.56
      17.759     0.999609       374918      2560.00
      17.919     0.999658       374938      2925.71
      18.031     0.999707       374957      3413.33
      18.223     0.999756       374973      4096.00
      18.383     0.999780       374984      4551.11
      18.431     0.999805       374991      5120.00
      18.511     0.999829       375000      5851.43
      18.559     0.999854       375010      6826.67
      18.623     0.999878       375020      8192.00
      18.655     0.999890       375023      9102.22
      18.687     0.999902       375028     10240.00
      18.735     0.999915       375032     11702.86
      18.815     0.999927       375037     13653.33
      19.055     0.999939       375042     16384.00
      19.071     0.999945       375044     18204.44
      19.135     0.999951       375046     20480.00
      19.199     0.999957       375048     23405.71
      19.263     0.999963       375051     27306.67
      19.311     0.999969       375053     32768.00
      19.391     0.999973       375054     36408.89
      19.439     0.999976       375055     40960.00
      19.567     0.999979       375056     46811.43
      19.615     0.999982       375058     54613.33
      19.647     0.999985       375059     65536.00
      19.647     0.999986       375059     72817.78
      19.839     0.999988       375060     81920.00
      19.839     0.999989       375060     93622.86
      19.855     0.999991       375061    109226.67
      19.887     0.999992       375062    131072.00
      19.887     0.999993       375062    145635.56
      19.887     0.999994       375062    163840.00
      19.887     0.999995       375062    187245.71
      19.903     0.999995       375063    218453.33
      19.903     0.999996       375063    262144.00
      19.903     0.999997       375063    291271.11
      19.903     0.999997       375063    327680.00
      19.903     0.999997       375063    374491.43
      20.223     0.999998       375064    436906.67
      20.223     1.000000       375064          inf
#[Mean    =        2.468, StdDeviation   =        1.664]
#[Max     =       20.208, Total count    =       375064]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1437992 requests in 15.00s, 0.89GB read
Requests/sec:  95869.55
Transfer/sec:     60.98MB